Revit 2026 API

# TessellatedBuildIssue Class

---

Types of issues encountered while constructing geometrical objects from the tessellated face sets.

SystemObject Autodesk.Revit.DBTessellatedBuildIssue

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class TessellatedBuildIssue : IDisposable
```
```vb
Public Class TessellatedBuildIssue
	Implements IDisposable
```
```cpp
public ref class TessellatedBuildIssue : IDisposable
```
```fsharp
type TessellatedBuildIssue =
    class
        interface IDisposable
    end
```

The TessellatedBuildIssue type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | NumberEncountered | How many times this issue was encountered in its face set during the face set processing. This number can be less than the total number of such issues in the face set, as the face set processing could be aborted due to the presence of the issues which could not be handled. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the TessellatedBuildIssue |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetIssueDescription | Gets a string describing the issue. If the issue does not present a problem, then an empty string is returned. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsValidIssue | Reports whether the issue is well-formed, valid and does describe a real problem. |
|  | MakesDataUnusable | Reports whether this issue makes some data unusable ('true') or is only shows that data format conventions were broken, but the data are still usable (false). |
|  | ReportIssueToDataSource | Reports whether this issue should be reported to the company which wrote the software which produced the face set data (true), or to Autodesk (false). |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace